app/controllers/demo_controller.rb

SELECT  `User`.* FROM `User`  ORDER BY `User`.`user_id` ASC LIMIT 1
---
  def index
  	@number=5
  	@user=User.all