app/controllers/demo1_controller.rb

  def index
  	@user=User.all
---
SELECT  `User`.* FROM `User`  ORDER BY `User`.`user_id` ASC LIMIT 1

  	def index
  	@doc=Doctor.all
---
SELECT `Doctor`.* FROM `Doctor`